<!DOCTYPE html>
<!-- +=================================+
     | Proyecto BENITO G. G.           |
     | =============================== |
     | (c) 2016 Miguel I. García López |
     |          FloppySoftware         |
     +=================================+ -->

<html>
	<head>
		<title>
			Benito G.G., Investigador Privado - by FloppySoftware
		</title>
		<meta name="author" content="Miguel I. Garc&iacute;a L&oacute;pez">
		<meta name="description" content="Proyecto Benito G. G., para Florida Universitaria">
		<meta name="keywords" content="Benito G.G., Java, Android, CSS3, HTML5, JavaScript">
		<meta charset="UTF-8">
		
		<!-- RESPONSIVE -->
		
		<meta name="viewport" content="width=device-width, initial-scale=1">
		
		<!-- ESTILOS CSS -->
		
		<link rel="stylesheet" type="text/css" href="gg_styles.css">
		
		<!-- JAVASCRIPT -->
		
		<script src="gg_scripts.js" type="text/javascript"></script>
	</head>
	
	<body>
		
		<!-- CABECERA -->
		
		<header>
			<img class="head" src="gg_cabecera.png" alt="Benito G.G., Investigador Privado">
		</header>
		
		<!-- MENU CABECERA -->
		
		<nav id="menu-cabecera" >
			<a class="cabecera" href="#juego">Juego</a>
			|
			<a class="cabecera" href="#aventuras">Aventuras</a>
			|
			<a class="cabecera" href="#informacion">Informaci&oacute;n</a>
		</nav>
			
		<!-- CONTENIDO -->
	
		<section id="contenido">
		
			<h2>
				Benito G. G.,
				<br>
				Investigador Privado
			</h2>
			
			<!-- BIENVENIDA -->
			
			<article id="bienvenida">
			
				<!-- JAVASCRIPT, TEXTO PERSONALIZADO DE BIENVENIDA -->
				
				<script type="text/javascript">

					// Nombre del jugador
					var nombre = nombreJugador();
					
					document.write("<h3>¡Hola " + nombre + "!</h3>");
					
					// Nivel de juego
					var escala = escalaCasos();
					
					if(escala >= 0 && escala <= 4) {
						var nivel = [
							"¡Adelante, ya queda menos para resolver tu primer caso!",
							"¡Ánimo, veo que ya has resuelto algún caso!",
							"¡Vas por muy buen camino, veo que has resuelto la mitad de los casos!",
							"¡Ánimo, veo que ya te quedan pocos casos por resolver!",
							"¡Enhorabuena, veo que eres un gran detective y has resuelto todos los casos!"
							];
						
						document.write("<p>" + nivel[escala] + "</p>");
					}
					
					// Zurdo
					
					// document.write(esZurdo());
					
				</script>
				
				<!-- TEXTO ESTÁNDAR DE BIENVENIDA -->
				
				<noscript>
				
					<h3>
						¡Hola amig@!
					</h3>
					
				</noscript>
				
				<p>
					¿Quieres conocer las &uacute;ltimas novedades
					acerca de Benito y sus aventuras?
				</p>
				
				<p>
					Si es as&iacute;, ¡est&aacute;s en el sitio adecuado!
				</p>
				
				<p>
					Pero sigue leyendo, sigue...
				</p>

			</article>
		
			<!-- QUIÉN ES BENITO G. G. -->
		
			<article id="quien_es_benito_gg">

				<h3>
					¿Qui&eacute;n es Benito G. G.?
				</h3>
				
				<figure class="right">
					<img class ="borde" src="gg_benito.png" alt="Imagen de Benito G.G.">
					<figcaption>
						&Eacute;ste es Benito
					</figcaption>
				</figure>
				
				<p>
					Benito Garc&iacute;a G&oacute;mez, m&aacute;s conocido como Benito G. G., es un
					detective privado peculiar,
					inteligente, pero un poco desastre, cuya zona de acci&oacute;n es el barrio
					de Chapuceros, enclavado en los bajos fondos de la ciudad de Sanpufo.
				</p>
				<p>
					En su quehacer diario, Benito ha de hab&eacute;rselas con maleantes casposos,
					gamberretes recalcitrantes, ancianas desconfiadas y alg&uacute;n que otro
					misterio impenetrable.
				</p>
				<p>
					Benito es famoso por haber llevado a cabo la resoluci&oacute;n de casos
					dif&iacute;ciles, como encontrar al gato de la señora Paquita (que no
					ten&iacute;a gato; ahora s&iacute;), y descubrir al ladr&oacute;n
					de jamones de la f&aacute;brica Pernil, S.L. mediante un m&eacute;todo
					ins&oacute;lito: el de practicar an&aacute;lisis de sangre a todos los
					empleados (Pepe, el encargado, ten&iacute;a m&aacute;s colesterol que
					todos los habitantes del barrio juntos).
				</p>
				
				<figure class="left">
					<img src="gg_ordenador.png" alt="Ordenador de Benito" >
					<figcaption>
						El ordenador de Benito
					</figcaption>
				</figure>
				
				<p>
					Para luchar contra el crimen, Benito cuenta con las mejores t&eacute;cnicas
					de investigaci&oacute;n, y la &uacute;ltima tecnolog&iacute;a. La &uacute;ltima
					que pudo comprar con sus menguados beneficios, claro est&aacute;. Menos mal
					que hab&iacute;a una buena oferta en el CarroFull, que si no, t&uacute; me dir&aacute;s
					c&oacute;mo se las iba a apañar con la m&aacute;quina de escribir Oliveretta
					de su abuelo.
				</p>
				
				<p>
					Entre los t&iacute;tulos y galardones varios que ostenta, el m&aacute;s codiciado
					sin duda es el Diploma en Grafolog&iacute;a y Papiroflexia, obtenido en la
					UCLA (Universidad Conquense de Licenciados Asturianos), aunque no
					menos importante es su Licenciatura en Criminolog&iacute;a y Macram&eacute;,
					cursada a distancia en la Universidad de Massaxuxes.
				</p>
				
				<p>
					En resumidas cuentas, Benito es la envidia del gremio. Del gremio de la
					hosteler&iacute;a, claro, porque hace unos bocadillos de garbanzos
					con fideos, que quitan el sent&iacute;o. No me extraña.
				</p>
			</article>
			
			<!-- EL JUEGO -->
			
			<article id="juego">
				<h3>
					El juego
				</h3>
				
				<iframe class="video" width="400" height="300" src="https://www.youtube.com/embed/kDA-9OXoRm8">
					¡Vaya, tu navegador no soporta &lt;iframe&gt;!
					<br>
					<br>
					Intentaba mostrarte este vídeo: <a href="https://www.youtube.com/watch?v=kDA-9OXoRm8">https://www.youtube.com/watch?v=kDA-9OXoRm8</a>
				</iframe>

				<p>
					En el juego, tendr&aacute;s que guiar a Benito en la resoluci&oacute;n
					de los casos que se le presentar&aacute;n mientras deambula por
					el barrio, en busca del olor inconfundible del crimen.
				</p>
				<p>
					Unos vecinos te ayudar&aacute;n y otros te confundir&aacute;n, as&iacute;
					que conf&iacute;a en tu instinto de detective, pues ser&aacute; tu
					mejor arma para desentrañar todos los misterios.
				</p>
				<p>
					Puedes descargar gratuitamente la aplicaci&oacute;n para dispositivos Android en <a href="https://play.google.com/store/apps/details?id=com.app.floppysoftware.benitogg.a&hl=es"
					target="_blank">la tienda de Google Play</a>.
				</p>
				<p>
					A continuaci&oacute;n te presento algunos de los personajes con los que
					tendr&aacute;s que v&eacute;rtelas.
				</p>
				
				<div class="two-boxes">
				
					<div class="left">
						
						<figure class="left">
							<img class ="borde" src="gg_loli.png" alt="Imagen de Loli">
							<figcaption>
								Loli
							</figcaption>
						</figure>
						
						<p>
							<em>Loli</em> tiene un quiosco, famoso por sus chuches con sabor a paella.
						</p>
						<p>
							Es muy servicial, aunque un tanto cotilla.
						</p>
						<p>
							Esta &uacute;ltima cualidad
							te puede ser muy &uacute;til si utilizas ese mel&oacute;n que tienes
							por cabeza, para algo m&aacute;s que ponerte el sombrero de detective.
						</p>
						<p>
							¡Ah, y no compres demasiadas chuches!
						</p>
					
					</div>
					
					<div class="right">
						
						<figure class="left">
							<img class ="borde" src="gg_porrot.png" alt="Imagen de Mister Porrot">
							<figcaption>
								Mr. Porrot
							</figcaption>
						</figure>
						
						<p>
							<em>Gustavo Porrot</em> es el gerente del <em>Hotel Hucho</em>,
							aunque prefiere que le llamen <em>M&iacute;ster Porrot</em>, dado
							que le gustan mucho las novelas de detectives
							de <a href="http://www.agathachristie.com/" target="_blank">Agatha Christie</a>,
							sobre todo las de <a href="http://www.agathachristie.com/characters/hercule-poirot" target="_blank">Poirot</a>. Como
							puedes ver, trata de imitar su aspecto.
						</p>
						<p>
							M&iacute;ster Porrot intentar&aacute; ayudarte en tus pesquisas, pero
							la mayor&iacute;a de las veces s&oacute;lo conseguir&aacute;
							embarullarlo todo a&uacute;n m&aacute;s.
						</p>
					
					</div>
				</div>
				
				<div class="two-boxes">
					<div class="left" >
						
						<figure class="left">
							<img class ="borde" src="gg_josechu.png" alt="Imagen de Josechu">
							<figcaption>
								Josechu
							</figcaption>
						</figure>
						
						<p>
							<em>Josechu</em> es el dueño del <em>Gimnasio Tirillas</em>, el mejor
							del barrio, m&aacute;s que nada porque no hay otro.
						</p>
						<p>
							Imparte clases de k&aacute;rate, taekwondo, judo, defensa personal, y
							bolillos.
						</p>
						<p>
							Es famoso por su capacidad de partir una viga de madera &uacute;nicamente
							con el pestañeo de su ojo izquierdo, aunque con el derecho tan s&oacute;lo ha
							llegado a romper una silla de pl&aacute;stico.
						</p>
						<p>
							Aunque tiene fama de duro, en el fondo tan s&oacute;lo es un chiquillo
							dulce y sensible.
						</p>
					
					</div>
							
					<div class="right" >
						
						<figure class="left">
							<img class ="borde" src="gg_exuperio.png" alt="Imagen de Exuperio">
							<figcaption>
								Exuperio
							</figcaption>
						</figure>
						
						<p>
							<em>Exuperio</em> es el dueño del <em>Cine Shin</em>,
							famoso por sus reposiciones constantes, aburridas, cansinas,
							repetitivas y desesperantes de pel&iacute;culas del Oeste. Del
							Oeste de Almer&iacute;a, que es donde se hac&iacute;a la
							mayor&iacute;a de esas pel&iacute;culas.
						</p>
						<p>
							Por si esto fuera poco, el car&aacute;cter de Exuperio
							es un tanto, digamos, dificilillo. Un cascarrabias, vamos.
						</p>
						<p>
							El mayor &eacute;xito de taquilla lo consigui&oacute; durante
							la reposici&oacute;n de <cite>Con balas y a lo loco</cite>, obteniendo
							una afluencia de p&uacute;blico de 3 personas, a lo largo de
							4 semanas. Eso es hacer historia en la industria cinematogr&aacute;fica,
							y lo dem&aacute;s son cuentos.
						</p>
					
					</div>
				</div>

			</article>
			
			<!-- MÁS AVENTURAS -->

			<article id="aventuras">
				<h3>
					Otras aventuras de Benito
				</h3>
					
				<p>
					Durante el ejercicio de su carrera profesional, Benito ha resuelto infinidad de casos,
					unos m&aacute;s f&aacute;ciles, otros m&aacute;s dif&iacute;ciles. Por
					citar algunos de ellos, sirva la siguiente selecci&oacute;n.
				</p>
				
				<div class="two-boxes">

					<div class="left" >
					
						<p>
							<em>Un caso no solicitado</em>
						</p>
						
						<img class="right" src="gg_caso_no_solicitado.png" alt="Imagen del caso">
						
						<p>
							Necesitaba un plan B. O uno C.
						</p>
						<p>
							La verdad es que me daba igual la letra que le designara, pero necesitaba un plan. Y ya.
						</p>
						<p>
							As&iacute; pues, puse a funcionar mi neurona fren&eacute;ticamente, para concebir el milagro hecho plan. Y vaya si lo conceb&iacute;, menudo soy yo para estas cosas. Y para las otras, ni les cuento. Lo denomin&eacute; “Plan T”. La “T”, es por la primera letra de la palabra timbre. Vamos, que llam&eacute; a un timbre. El que se puso m&aacute;s a dedo, concretamente.
						</p>
						<p>
							-¿Qui&eacute;n es? -dijo una voz melodiosamente desagradable.
						</p>
						<p>
							-¡El butanero! -respond&iacute; yo, haciendo un alarde de imaginaci&oacute;n.
						</p>
						<p>
							-Aqu&iacute; no tenemos gas -dijo la misma voz masculina, pero bastante m&aacute;s antip&aacute;tica, por cierto.
						</p>
						<p>
							-Y ¿c&oacute;mo cocinan sus pucheros, oiga? – me atrev&iacute; a decir, aunque la verdad es que no estuve muy acertado. O s&iacute;, no s&eacute;. Juzguen ustedes.
						</p>
						<p>
							-A ver, que s&iacute; que tenemos gas en el edificio. Lo que quiero decir, es que es el de las tuber&iacute;as esas, ¿me entiende? Que no usamos bombonas… ¿C&oacute;mo se llama? ¡El gas ciudad, &eacute;se! -dijo el señor, en tono resabidillo.
						</p>
						<p>
							-¡Pues muy mal, caballero, muy mal! -aqu&iacute; ya estaba yo desatado- Lo que yo le traigo es gas de pueblo, que es mucho m&aacute;s sano y natural que el de ciudad. Y embotellado y todo, ¿c&oacute;mo va usted a comparar?
						</p>
						<p>
							Con este comentario acert&eacute; de pleno, pues el vecino cabezota empeñado en no dejarme entrar, por un qu&iacute;tame all&aacute; esos gases, al final accedi&oacute; a abrirme la puerta.
						</p>
					</div>
					
					<div class="right" >
					
						<p>
							<em>El caso del sabueso diminuto</em>
						</p>
						
						<img class="right" src="gg_caso_sabueso.png" alt="Imagen del caso">
					
						<p>
							Ten&iacute;a ante m&iacute; uno de esos casos en los que preciso de todas mis facultades, aunque, huelga decirlo, son tantas y de tan variable &iacute;ndole, que resulta extremadamente dif&iacute;cil hallar un misterio que las requiera en su totalidad.
						</p>
						<p>
							A pesar de esto, mi profesionalidad me obliga a tratar el caso m&aacute;s nimio tal como si fuera el asesinato del siglo. Siempre pongo toda la carne en el asador, y tras devorarla convenientemente, acompañ&aacute;ndola de un buen Rioja, echo la consabida siesta.
						</p>
						<p>
							Mano de santo, pues una vez descansada la neurona, pongo toda mi atenci&oacute;n en el misterio de turno, de tal forma, que es s&oacute;lo cuesti&oacute;n de tiempo el hallar la soluci&oacute;n, por oculta que &eacute;sta pueda presentarse.
						</p>
					</div>
				
				</div>
				
				<div class="two-boxes">
				
					<div class="left" >
					
						<p>
							<em>El caso de los an&oacute;nimos multicolor</em>
						</p>
						
						<img class="right" src="gg_caso_anonimos.png" alt="Imagen del caso">
					
						<p>
							En mi larga carrera contra el crimen, jam&aacute;s hab&iacute;a topado con un caso como aqu&eacute;l.
						</p>
						<p>
							Mi clienta, doña Julia, esposa de un mangante… esto… un magnate de los de tomo y lomo, con m&uacute;ltiples negocios a cual m&aacute;s rentable, o como se dice ahora, diversificaci&oacute;n de inversiones, estaba muy asustada.
						</p>
						<p>
							Y no era para menos. En las &uacute;ltimas semanas, hab&iacute;a recibido la friolera de cuatro escritos amenazantes, de autor desconocido.
						</p>
						<p>
							O lo que es lo mismo, mogoll&oacute;n de mensajes an&oacute;nimos con muy mala leche.
						</p>
					</div>

					<div class="right" >
					
						<p>
							<em>La guerra fr&iacute;a</em>
						</p>
						
						<img class="right" src="gg_caso_guerra_fria.png" alt="Imagen del caso">
					
						<p>
							Todav&iacute;a pude vivir, durante el inicio de mi carrera profesional, los &uacute;ltimos estertores de la llamada guerra fr&iacute;a.
						</p>
						<p>
							Lo recuerdo con amargura y cierto repel&uacute;s, pues casi todos mis ingresos se iban en ropa de abrigo. Si he de serles sincero, prefiero las guerras templadas. Siempre he sido muy friolero, y mi madre se encarga de record&aacute;rmelo cada dos por tres:
						</p>
						<p>
							-Benito, ¿no vas muy fresco para el tiempo que hace?
						</p>
						<p>
							-Mam&aacute;, que me tengo que ir a trabajar, y hoy he de disfrazarme de macarra musculitos para un caso…
						</p>
						<p>
							-T&uacute; ponte el abrigo y la bufanda, que hace mucho frio, o pillar&aacute;s un resfriado. Hazle caso a tu madre, que sabe m&aacute;s que t&uacute; de estas cosas.
						</p>
						<p>
							Y como no pod&iacute;a ser de otra manera, salgo de casa con el abrigo, la bufanda, el gorro, y los guantes puestos. Faltar&iacute;a m&aacute;s.
						</p>
					</div>
					
				</div>
				
			</article>
			
			<!-- MÁS INFORMACIÓN -->
					
			<article id="informacion">
					
				<h3>
					Informaci&oacute;n
				</h3>

				<p>
					Esta p&aacute;gina web ha sido desarrollada
					en <a href="http://www.w3schools.com/html/html5_intro.asp" target="_blank">HTML5</a>,
					<a href="http://www.w3schools.com/css/css3_intro.asp" target="_blank">CSS3</a>,
					y <a href="http://www.w3schools.com/js/" target="_blank">JavaScript</a>,
					como parte
					del proyecto profesional del <em>Ciclo Formativo de Grado
					Superior de Desarrollo de Aplicaciones Multiplataforma</em>, cursado
					en <a href="http://www.floridauniversitaria.es/" target="_blank">Florida Universitaria</a>.
				</p>
				
				<p>
					Para realizarla, se ha utilizado <a href="http://notepad-plus-plus.org/" target="_blank">Notepad++</a>.
				</p>
				
				<p>
					Se ha diseñado para ser <cite>responsive</cite>, y
					su c&oacute;digo fuente ha sido comprobado con los validadores
					de <a href="https://validator.w3.org/" target="_blank">HTML5</a>
					y <a href="https://jigsaw.w3.org/css-validator/" target="_blank">CSS3</a> de
					la <a href="https://www.w3.org/" target="_blank">W3C</a>.
				</p>
				
				<img class="right" src="logo_zurdos_friendly.png" alt="Esta app es Zurdos Friendly">
				
				<p>
					Dicho proyecto consta tambi&eacute;n de una aplicaci&oacute;n para
					dispositivos <a href="http://www.android.com/" target="_blank">Android</a>, desarrollada
					en el lenguaje de programaci&oacute;n <a href="http://www.java.com/" target="_blank">Java</a>
					y el sistema de gesti&oacute;n de bases de
					datos <a href="http://www.sqlite.org/" target="_blank">SQLite</a>.
				</p>
				
				<p>
					Se ha diseñado teniendo en cuenta a los usuarios zurdos (yo no lo soy, pero mi hijo sí).
				</p>
				
				<p>
					Para realizarla, se ha
					utilizado <a href="http://developer.android.com/intl/es/sdk/index.html" target="_blank">Android Studio</a>.
				</p>
				
				<p>
					Powered by
				</p>
				
				<a class="image" href="http://www.floppysoftware.es" target="_blank">
					<img src="logo_floppy_software.png" alt="Logo de FloppySoftware">
				</a>

			</article>
			
			<!-- LOGOS DE LA W3C -->
			
			<hr>
					
			<p>
				<img class="w3c" src="logo_w3c_html.png" alt="¡HTML5 V&aacute;lido!" />
				<img class="w3c" src="logo_w3c_css.png" alt="¡CSS V&aacute;lido!" />
			</p>

		</section>
		
		<!-- PIE -->
		
		<footer>
			&copy; 2016 Miguel I. Garc&iacute;a L&oacute;pez
		</footer>
		
	</body>

</html>
